In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('../dataset/titanic.csv')
df

     survived  pclass  gender   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

### Do EDA (Exploratory Data Analysis) on the dataset (Hint: head, columns, etc)

In [5]:
df.head()

   survived  pclass  gender   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [4]:
df.columns

Index(['survived', 'pclass', 'gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

In [6]:
df.tail()

     survived  pclass  gender   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [7]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   gender    891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

### Find passengers whose age is between 20 and 2

In [15]:
df[df['age'].between(2, 20)].sort_values(by='age')

     survived  pclass  gender   age  sibsp  parch      fare embarked deck
7           0       3    male   2.0      3      1   21.0750        S  NaN
16          0       3    male   2.0      4      1   29.1250        Q  NaN
119         0       3  female   2.0      4      2   31.2750        S  NaN
205         0       3  female   2.0      0      1   10.4625        S    G
297         0       1  female   2.0      1      2  151.5500        S    C
..        ...     ...     ...   ...    ...    ...       ...      ...  ...
664         1       3    male  20.0      1      0    7.9250        S  NaN
840         0       3    male  20.0      0      0    7.9250        S  NaN
725         0       3    male  20.0      0      0    8.6625        S  NaN
762         1       3    male  20.0      0      0    7.2292        C  NaN
876         0       3    male  20.0      0      0    9.8458        S  NaN

[165 rows x 9 columns]

### Find passengers where gender is female and passenger class is 1

In [17]:
df[(df['gender'] == "female") & (df['pclass'] == 1)]

     survived  pclass  gender   age  sibsp  parch      fare embarked deck
1           1       1  female  38.0      1      0   71.2833        C    C
3           1       1  female  35.0      1      0   53.1000        S    C
11          1       1  female  58.0      0      0   26.5500        S    C
31          1       1  female   NaN      1      0  146.5208        C    B
52          1       1  female  49.0      1      0   76.7292        C    D
..        ...     ...     ...   ...    ...    ...       ...      ...  ...
856         1       1  female  45.0      1      1  164.8667        S  NaN
862         1       1  female  48.0      0      0   25.9292        S    D
871         1       1  female  47.0      1      1   52.5542        S    D
879         1       1  female  56.0      0      1   83.1583        C    C
887         1       1  female  19.0      0      0   30.0000        S    B

[94 rows x 9 columns]

In [24]:
df['pclass'].unique()

array([3, 1, 2])

### Find average age of female and male passengers

In [27]:
avg_male_age = df[df['gender'] == 'male']['age'].mean()
avg_female_age = df[df['gender'] == 'female']['age'].mean()
print("Average Male Age:", avg_male_age)
print("Average Female Age:", avg_female_age)

Average Male Age: 30.72664459161148
Average Female Age: 27.915708812260537

### 5. Count number of passengers in each passenger class.

In [31]:
groupped_pclass = df.groupby('pclass').agg({'pclass':'count'})
groupped_pclass

        pclass
pclass
1          216
2          184
3          491

In [32]:
df['pclass'].value_counts()

pclass
3    491
1    216
2    184
Name: count, dtype: int64

#### 6. Separate passengers who survived (survived column contains 0) and who did not survive (survived column contains 1) into two separate dataframes.

In [33]:
df_survived = df[df['survived'] == 1]
df_not_survived = df[df['survived'] == 0]

#### 7. For the above two dataframes, find number of females and males.

In [34]:
male_count_survived = df_survived[df_survived['gender'] == 'male'].shape[0]
female_count_survived = df_survived[df_survived['gender'] == 'female'].shape[0]
male_count_not_survived = df_not_survived[df_not_survived['gender'] == 'male'].shape[0]
female_count_not_survived = df_not_survived[df_not_survived['gender'] == 'female'].shape[0]
print("Survived - Males:", male_count_survived, "Females:", female_count_survived)
print("Not Survived - Males:", male_count_not_survived, "Females:", female_count_not_survived)

Survived - Males: 109 Females: 233
Not Survived - Males: 468 Females: 81

#### 8. Sort the original dataframe on age in descending order and display the top 3 records.

In [39]:
df['age'] = df['age'].astype('int64', errors='ignore')
df['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [42]:
df.sort_values(by=['age'], ascending=False).head(3)

     survived  pclass gender   age  sibsp  parch     fare embarked deck
630         1       1   male  80.0      0      0  30.0000        S    A
851         0       3   male  74.0      0      0   7.7750        S  NaN
493         0       1   male  71.0      0      0  49.5042        C  NaN